performance/results/raw/disk/container/random-write.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

random-write: (groupid=0, jobs=1): err= 0: pid=12: Wed Sep 23 14:48:24 2026
  write: IOPS=8632, BW=33.7MiB/s (35.4MB/s)(1012MiB/30001msec); 0 zone resets
    clat (usec): min=48, max=28589, avg=114.79, stdev=98.75
     lat (usec): min=48, max=28589, avg=114.92, stdev=98.78
    clat percentiles (usec):
     |  1.00th=[   78],  5.00th=[   82], 10.00th=[   83], 20.00th=[   88],
     | 30.00th=[   94], 40.00th=[   96], 50.00th=[  101], 60.00th=[  109],
     | 70.00th=[  118], 80.00th=[  129], 90.00th=[  153], 95.00th=[  184],
     | 99.00th=[  289], 99.50th=[  351], 99.90th=[  709], 99.95th=[  906],
     | 99.99th=[ 1942]
   bw (  KiB/s): min=24184, max=43464, per=99.66%, avg=34414.17, stdev=4910.23, samples=59
   iops        : min= 6046, max=10866, avg=8603.54, stdev=1227.56, samples=59
  lat (usec)   : 50=0.01%, 100=48.30%, 250=49.84%, 500=1.67%, 750=0.11%
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=2.07%, sys=36.32%, ctx=258887, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,258984,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=33.7MiB/s (35.4MB/s), 33.7MiB/s-33.7MiB/s (35.4MB/s-35.4MB/s), io=1012MiB (1061MB), run=30001-30001msec

Disk stats (read/write):
  sda: ios=0/257825, sectors=0/2062784, merge=0/23, ticks=0/26333, in_queue=26333, util=88.63%